// #include <stdio.h>

// int main() {
//     printf("Hello, World!\n");
//     return 0;
// }


// #include <stdio.h>

// int main() {
//     printf("Алгоритмизация и программирование\n");
//     printf("Лабораторная работа №1\n");
//     printf("Моя первая программа на языке C запущена успешно\n");
//   return 0;
//  }


// #include <stdio.h>

//     int main() {
//         printf("\"Заголовок\"\n");
//         printf("Я люблю маму");
//         printf("\tЯ люблю папу");
//         return 0;
//     }


/*
    Ф. И. О.: Иванов Иван Иванович
    Группа: ИС-101
    Назначение программы: вывод заголовка и двух строк в терминал.
*/

// #include <stdio.h>

// int main()
// {
//     // Вывод заголовка программы
//     printf("Лабораторная работа №1\n");

//     /*
//        Вывод двух строк,
//        разделённых табуляцией
//     */
//     printf("Первая строка\tВторая строка\n");

//     return 0;
// }




/*
 * Белов Иван Александрович ПИ-1.1  *
 * Группа: ПИ-11
 * Назначение: Программа выводит карточку лабораторной работы №1
 */

#include <stdio.h>

int main(void)
{
    printf("ЛАБОРАТОРНАЯ РАБОТА № 1\n");
    printf("Дисциплина: Алгоритмизация и программирование\n");
    printf("Язык: C\n");
    printf("Тема: Первая программа\n\n");
    
    printf("| Элемент\t| Назначение\t\t|\n");
    printf("| #include\t| Подключение библиотеки\t|\n");
    printf("| main\t\t| Начало выполнения\t|\n");
    printf("| printf\t| Вывод текста\t\t|\n");
    printf("| return 0\t| Успешное завершение\t|\n\n");
    
    printf("Статус: программа выполнена успешно\n");
    printf("Оценка: \"отлично\"\n");
    
    return 0;
}




